BaseConfiguration/Money_2_0/Enums/ГруппыВычетовПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ГруппыВычетовПоНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стандартные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартныеНаДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущественные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Социальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальныеПоУведомлениюНО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ВидыДоходовНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыДоходовНДФЛ</Name>
			<Comment>АПК:413 ОбработкаПолученияДанныхВыбора для сортировки, допустима история выбора при вводе</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогообложенияРезидента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НДФЛСтавкиНалогообложенияРезидента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОблагаетсяУНалоговогоАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПрименяемыйВНалоговойОтчетностиС2010Года</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПрименяемыйВНалоговойОтчетностиС2021Года</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычетРассчитываетсяАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычетПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмеетЕдинственныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетОплатеТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/CommonModules/УчетНДФЛ/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает код вычета для дохода НДФЛ.
// Если код вычета не определен, то возвращается пустая ссылка.
Функция КодВычетаПоКодуДоходаНДФЛ(КодДоходаНДФЛ) Экспорт
	КодВычета = Справочники.ВидыВычетовНДФЛ.ПустаяСсылка();	
	Если ЗначениеЗаполнено(КодДоходаНДФЛ) Тогда
		РеквизитыКодаДохода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КодДоходаНДФЛ, "ИмеетЕдинственныйВычет,ВычетПоУмолчанию");
		Если РеквизитыКодаДохода.ИмеетЕдинственныйВычет Тогда
			КодВычета  = РеквизитыКодаДохода.ВычетПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	Возврат КодВычета	
КонецФункции 

// Возвращает соответствие кодов доходов и допустимых для них вычетов.
// Соответствие поддерживается с 2010 года.
//
// Параметры:
//	НалоговыйПериод - число - налоговый период (год).
//
// Возвращаемое значение:
//	Соответствие:
//		ключом является Код дохода - СправочникСсылка.ВидыДоходовНДФЛ
//		значением является массив Кодов вычета - СправочникСсылка.ВидыВычетовНДФЛ
//
Функция ВычетыКДоходам(НалоговыйПериод) Экспорт
	
	СоответствиеДоступныхВычетовДоходам = Новый Соответствие;
	
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1010, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код601));
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1211, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код607));
	
	// Описание кодов 1530 и 1531 по годам.
	Если НалоговыйПериод > 2016 Тогда // с 2017 года
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код201);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код208);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код216);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код218);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код222);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код618);
		
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1530, МассивДоступныхВычетов);
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код202);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код217);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код219);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код223);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1531, МассивДоступныхВычетов);
		
	ИначеЕсли НалоговыйПериод = 2016 Тогда // 2016 год
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код201);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код208);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код216);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код218);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код222);
		
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1530, МассивДоступныхВычетов);
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код202);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код217);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код219);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код223);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1531, МассивДоступныхВычетов);
		
	ИначеЕсли НалоговыйПериод = 2015 Тогда // 2015 год
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код201);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код218);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код222);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код618);
		
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1530, МассивДоступныхВычетов);
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код202);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код217);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код218);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код219);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код223);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1531, МассивДоступныхВычетов);
		
	ИначеЕсли НалоговыйПериод = 2014 Тогда // 2014 год
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код201);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код204);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код205);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код208);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код212);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код216);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код218);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код222);
		
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1530, МассивДоступныхВычетов);
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код202);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код217);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код218);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код219);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код223);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код620);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1531, МассивДоступныхВычетов);
		
	ИначеЕсли НалоговыйПериод > 2011 Тогда // 2012-2013 годы
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код201);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код204);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код205);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код208);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код212);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код216);
		
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1530, МассивДоступныхВычетов);
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код202);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код217);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код620);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1531, МассивДоступныхВычетов);
		
	ИначеЕсли НалоговыйПериод = 2011 Тогда // 2011 год
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код201);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код204);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код205);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код208);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код209);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код211);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код212);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код215);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код216);
		
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1530, МассивДоступныхВычетов);
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код202);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код203);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код216);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код217);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1531, МассивДоступныхВычетов);
		
	Иначе // по 2010 год
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код201);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код204);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код205);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код208);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код209);
		
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1530, МассивДоступныхВычетов);
		
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код202);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код203);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1531, МассивДоступныхВычетов);
		
	КонецЕсли;
	
	// Описание кода 1532 по годам.
	МассивДоступныхВычетов = Новый Массив;
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код205);	
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код206);
	Если НалоговыйПериод = 2010 Или НалоговыйПериод = 2011 Тогда 
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код207);
	КонецЕсли;
	Если НалоговыйПериод > 2015 Тогда 
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код208);
	КонецЕсли;
	Если НалоговыйПериод < 2017 Тогда 
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код209);
	КонецЕсли;
	Если НалоговыйПериод = 2011 Тогда 
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код210);
	КонецЕсли;
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1532, МассивДоступныхВычетов);
	
	// Описание кода 1533 по годам.
	МассивДоступныхВычетов = Новый Массив;
	Если НалоговыйПериод = 2010 Или НалоговыйПериод = 2011 Тогда 
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код202);	
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код203);	
	КонецЕсли;
	Если НалоговыйПериод >= 2014 Тогда // с 2014 года
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код220);
	КонецЕсли;
	Если НалоговыйПериод >= 2011 И НалоговыйПериод <= 2014 Тогда // с 2011 по 2014 годы
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код620);
	КонецЕсли;
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1533, МассивДоступныхВычетов);
	
	// Описание кода 1535 по годам.
	МассивДоступныхВычетов = Новый Массив;
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код207);
	Если НалоговыйПериод >= 2014 Тогда // с 2014 года
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код209);
	КонецЕсли;
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код210);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1535, МассивДоступныхВычетов);
		
	// Описание кода 1536 по годам.
	МассивДоступныхВычетов = Новый Массив;
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код203);	
	Если НалоговыйПериод >= 2014 Тогда // с 2014 года
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код224);
	КонецЕсли;
	Если НалоговыйПериод > 2011 И НалоговыйПериод <= 2014 Тогда // с 2012 по 2014 годы
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код620);
	КонецЕсли;
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1536, МассивДоступныхВычетов);
		
	// Описание кода 1537 по годам.
	Если НалоговыйПериод >= 2011 Тогда // с 2011 года
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код211);	
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1537, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1538 по годам.
	Если НалоговыйПериод >= 2011 Тогда // с 2011 года
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код215);
		Если НалоговыйПериод = 2011 Тогда // 2011 год
			МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код214);
			МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код216);
			МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код217);
		КонецЕсли;
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1538, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1539 по годам.
	Если НалоговыйПериод >= 2011 Тогда // с 2011 года
		МассивДоступныхВычетов = Новый Массив;
		Если НалоговыйПериод = 2011 Тогда // 2011 год
			МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код212);
		КонецЕсли;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код213);
		Если НалоговыйПериод <= 2014 Тогда
			МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код214);
		КонецЕсли;
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1539, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1541 по годам.
	Если НалоговыйПериод >= 2011 Тогда // с 2011 года
		МассивДоступныхВычетов = Новый Массив;
		Если НалоговыйПериод <= 2014 Тогда // по 2014 год
			МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код212);
			МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код213);
		КонецЕсли;
		Если НалоговыйПериод >= 2014 Тогда // с 2014 года
			МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код620);
		КонецЕсли;
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1541, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1543 по годам.
	Если НалоговыйПериод > 2016 Тогда 
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1543, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код617));
	ИначеЕсли НалоговыйПериод >= 2014 Тогда 	
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1543, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код221));
	КонецЕсли;
	
	// Описание кода 1544 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код221);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код233);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код237);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код239);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код251);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1544, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1545 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код226);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код234);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код238);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код240);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1545, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1546 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код228);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код250);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код251);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1546, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1547 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код235);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1547, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1548 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код229);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код241);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код252);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1548, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1549 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код227);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код236);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1549, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1551 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код230);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1551, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1552 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код232);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1552, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1553 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код231);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1553, МассивДоступныхВычетов);
	КонецЕсли;
	
	// Описание кода 1554 по годам.
	Если НалоговыйПериод >= 2016 Тогда
		МассивДоступныхВычетов = Новый Массив;
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код620);
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код1554, МассивДоступныхВычетов);
	КонецЕсли;
	
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2010, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код403));

	МассивДоступныхВычетов = Новый Массив;
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код404);
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код405);	
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2201, МассивДоступныхВычетов);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2202, МассивДоступныхВычетов);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2203, МассивДоступныхВычетов);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2204, МассивДоступныхВычетов);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2205, МассивДоступныхВычетов);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2206, МассивДоступныхВычетов);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2207, МассивДоступныхВычетов);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2208, МассивДоступныхВычетов);
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2209, МассивДоступныхВычетов);
	
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2720, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код501));
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2730, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код502));
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2740, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код505));
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2760, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код503));
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2761, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код506));
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2762, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код508));
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2770, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код504));
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2790, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код507));
	
	
	// описание кода 2791
	Если НалоговыйПериод < 2016 Тогда // по 2015 год
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2791, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код509));
	КонецЕсли;

	// описание кода 3010
	Если НалоговыйПериод > 2017 Тогда // с 2018 года
		Доход3010 = Доход3010();
		Если ЗначениеЗаполнено(Доход3010) Тогда
			СоответствиеДоступныхВычетовДоходам.Вставить(Доход3010, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код620));
		КонецЕсли;  
	КонецЕсли;
	
	// описание кода 2763
	Если НалоговыйПериод > 2019 Тогда // с 2020 года
		СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код2763, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код511));
	КонецЕсли;
	
	СоответствиеДоступныхВычетовДоходам.Вставить(Справочники.ВидыДоходовНДФЛ.Код4800, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыВычетовНДФЛ.Код620));
		
	Возврат СоответствиеДоступныхВычетовДоходам;
	
КонецФункции

// Возвращает массив кодов вычетов соответствующего года с учетом ограничения переданной группой вычетов.
// Поддерживается с 2010 года.
//
// Параметры:
//	НалоговыйПериод - число - налоговый период (год).
//	ГруппаВычета - ПеречислениеСсылка.ГруппыВычетовПоНДФЛ, массив - 
//
// Возвращаемое значение:
//	Массив значений типа СправочникСсылка.ВидыВычетовНДФЛ
//
Функция ВычетыНалогоплательщика(НалоговыйПериод, Знач ГруппаВычета = Неопределено) Экспорт

	МассивДоступныхВычетов = Новый Массив;
	
	// Личные вычеты
	Если НалоговыйПериод > 2011 Тогда // с 2012 отменен 103 вычет
	Иначе // по 2011
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код103);
	КонецЕсли;
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код104);
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код105);
	
	// Вычеты на детей
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код108);
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код109);
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код110);
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код111);
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код112);
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код113);
	Если НалоговыйПериод > 2011 Тогда
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код115);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код116);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код119);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код120);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код123);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код124);
	КонецЕсли;
	Если НалоговыйПериод > 2014 Тогда
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код130);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код131);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код132);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код117о);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код135);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код137);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код139);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код121о);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код143);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код145);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код147);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код125о);
	КонецЕсли;
	
	// Имущественные вычеты
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код311);
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код312);
	Если НалоговыйПериод < 2016 Тогда
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код318);
	КонецЕсли;
	
	// Социальные вычеты
	МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код319);
	Если НалоговыйПериод > 2012 Тогда 
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код320);
	КонецЕсли;
	Если НалоговыйПериод > 2015 Тогда 
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код320о);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код321);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код324);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код325);
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код326);
	КонецЕсли;
	Если НалоговыйПериод > 2016 Тогда 
		МассивДоступныхВычетов.Добавить(Справочники.ВидыВычетовНДФЛ.Код329);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГруппаВычета) Тогда
		ГруппаВычета = Новый Массив;
		ГруппаВычета.Добавить(Перечисления.ГруппыВычетовПоНДФЛ.Имущественные);
		ГруппаВычета.Добавить(Перечисления.ГруппыВычетовПоНДФЛ.Социальные);
		ГруппаВычета.Добавить(Перечисления.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО);
		ГруппаВычета.Добавить(Перечисления.ГруппыВычетовПоНДФЛ.Стандартные);
		ГруппаВычета.Добавить(Перечисления.ГруппыВычетовПоНДФЛ.СтандартныеНаДетей);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппыВычетов", ГруппаВычета);
	Запрос.УстановитьПараметр("Ссылки", МассивДоступныхВычетов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыВычетовНДФЛ.Ссылка
	|ИЗ
	|	Справочник.ВидыВычетовНДФЛ КАК ВидыВычетовНДФЛ
	|ГДЕ
	|	ВидыВычетовНДФЛ.ГруппаВычета В(&ГруппыВычетов)
	|	И ВидыВычетовНДФЛ.Ссылка В(&Ссылки)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции



#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс


#Область УчетНДФЛПовтИсп

Функция Доход3010() Экспорт

	Возврат	Справочники.ВидыДоходовНДФЛ.НайтиПоКоду("3010")

КонецФункции 

#КонецОбласти 


#КонецОбласти


#Область СлужебныеПроцедурыИФункции



#КонецОбласти
